#include "math.h"
#include "msp430f5529_adc.h"
#include "LMT70.h"
/*-------------------------------------------------------------------------------
*  本部分主要为LMT70数据的采集                         
--------------------------------------------------------------------------------*/
#define a2     -8.451576E-06    //二阶拟合参数
#define b2     -1.769281E-01    //二阶拟合参数
#define c2     2.043937E+02     //二阶拟合参数
//T = aV^2+bV+c

#define a3     -1.064200E-09    //三阶拟合参数
#define b3     -5.759725E-06    //三阶拟合参数
#define c3     -1.789883E-01    //三阶拟合参数
#define d3     2.048570E+02     //三阶拟合参数
//T = aV^3+bV^2+cV+d

/*******************************************************************************
*  函数名称：Temp_adc()                           
*  功能说明：转换一次并读取LMT70的结果
*  参数说明：无
*  函数返回：电压(mV)
*  使用示例：无
********************************************************************************/
float Temp_adc()
{
  return (ADC_ReadChanelOnce  (ADC_CH1)*2.5/4095*1000);
}

/*******************************************************************************
*  函数名称：Temp_1                           
*  功能说明：一阶线性函数计算温度 适用于20℃-30℃
*  参数说明：无
*  函数返回：温度
*  使用示例：无
********************************************************************************/
float Temp_1()
{
  float T_adc = Temp_adc();
  float T_m1 = -1.193 * T_adc + 212.009;
  return T_m1;
}

/*******************************************************************************
*  函数名称：Temp_2                           
*  功能说明：二阶线性函数计算温度 适用于-55℃-150℃
*  参数说明：无
*  函数返回：温度
*  使用示例：无
********************************************************************************/
float Temp_2()
{
  float T_adc = Temp_adc();
  float T_m2 = a2 * T_adc * T_adc + b2 * T_adc + c2;
  return T_m2;
}

/*******************************************************************************
*  函数名称：Temp_3                          
*  功能说明：三阶线性函数计算温度 适用于-55℃-150℃
*  参数说明：无
*  函数返回：温度
*  使用示例：无
********************************************************************************/
float Temp_3()
{
  float T_adc = Temp_adc();
  float T_m3 = a3 * T_adc * T_adc * T_adc + b3 * T_adc * T_adc + c3 * T_adc + d3;
  return T_m3;
}


